import os
import django

os.environ.setdefault('DJANGO_SETTINGS_MODULE', 'DjangoProject1.settings')
django.setup()

from tours.models import City

# Словник країна -> список міст
cities_data = {
    "Єгипет": [
        "Регіон Шарм ель Шейх", "Дахаб", "Таба", "Шарм-ель-Шейх",
        "Регіон Хургада", "Ель-Гуна", "Макаді Бей", "Сафага", "Сахл Хашиш",
        "Сома Бей", "Хургада", "Регіон Марса Алам", "Ель Кусейр", "Марса Алам",
        "Каїр та Середземне море", "Ель-Аламейн", "Каїр", "Мерса-Матрух", "Асуан", "Луксор"
    ],
    "ОАЕ": [
        "Абу Дабі", "Аджман", "Аль Айн", "Дубай", "Корфаккан", "о. Сір-Бані-Яс",
        "Рас Аль-Хайма", "Умм Аль-Кувейн", "Фуджейра", "Шарджа"
    ],
    "Туреччина": [
        "Анталійське узбережжя", "Аланія", "Авсаллар", "Аланія Центр", "Інжекум",
        "Каргиджак", "Кестель", "Конакли", "Махмутлар", "Обагол", "Обакой", "Окурджалар",
        "Паяллар", "Тосмур", "Турклер", "Анталія", "Анталія Центр", "Коньяалти", "Кунду",
        "Лара", "Белек", "Белек Центр", "Богазкент", "Кадріє", "Каш", "Кемер", "Бельдібі",
        "Гьойнюк", "Кемер Центр", "Кіріш", "Текірова", "Чамьюва", "Чирали", "Сіде", "Гюндогду",
        "Евренсекі", "Кізілагач", "Кізілот", "Кумкой", "Манавгат", "Сіде Центр", "Соргун",
        "Тітреєнгьоль", "Ченгер", "Чолакли", "Егейське узбережжя", "Бодрум", "Акьярлар", "Бітез",
        "Бодрум Центр", "Гуверджінлік", "Гундоган", "Гюллюк", "Гюмбет", "Ортакент", "Торба",
        "Тургутрейс", "Туркбуку", "Яликавак", "Яличифтлік", "Даламан", "Дідім", "Акбук",
        "Альтінкум", "Дідім Центр", "Ефес", "Ізмір", "Кушадаси", "Мармаріс", "Армуталан", "Датча",
        "Ічмелер", "Мармарис Центр", "Сітелер", "Турунч", "Хісароню", "Оздере", "Саригерме",
        "Фетхіє", "Гьочек", "Овачік", "Олюденіз", "Фетхіє Центр", "Яніклар", "Чешме", "Алачати",
        "Іліка", "Чешме Центр", "Центральна Туреччина", "Анкара", "Афьон", "Ерджієс", "Каппадокія",
        "Аванос", "Гьореме", "Невшехір", "Ортахісар", "Ургюп", "Учхісар", "Карс", "Карталкая", "Конья",
        "Паландокен", "Улудаг", "Мармурове узбережжя", "Ізмит", "Ялова", "Чорноморське узбережжя",
        "Трабзон", "Ані", "Бурса", "Ван", "Газіантеп", "Давраз", "Діярбакир", "Догубаязіт", "Ерзурум",
        "Ігнеада", "Ізнік", "Кангал", "Карасу", "Картепе", "Кахта", "Кизкалесі", "Мардін", "Мерсін",
        "Памуккале", "Пергам", "Різе", "Самсун", "Сарикамиш", "Сафранболу", "Сіліфке", "Стамбул", "Троя",
        "Чанаккале", "Шанлиурфа"
    ],
    "Шрі-Ланка": [
        "Північно-Західне узбережжя", "Вайккала", "Калпітія", "Маравіла", "Чілау",
        "Північно-Східне узбережжя", "Трінкомалі", "Західне узбережжя", "Амбалангода", "Ахунгалла",
        "Бентота", "Берувела", "Ваддува", "Індурува", "Калутара", "Коломбо", "Косгода", "Негомбо",
        "Хіккадува", "Південно-Східне узбережжя", "Аругам-Бей", "Південне узбережжя", "Велігама", "Галле",
        "Діквелла", "Коггала", "Матара", "Міріса", "Тангалле", "Унаватуна", "Хамбантота", "Східне узбережжя",
        "Пасікуда", "Анурадхапура", "Дамбулла", "Джафна", "Канді", "Катарагама", "Нувара Елія", "Полоннарува",
        "Ратнапура"
    ],
    "Болгарія": [
        "Албена", "Балчик", "Банско", "Боровець", "Бургас", "Бяла", "Варна", "Велико-Тирнове", "Велінград",
        "Вітоша", "Гоце делчев", "Девін", "Дюни", "Єленіте", "Золоті піски", "Каварна", "Кранєво", "Несебр",
        "Обзор", "Павло-Баня", "Пампорово", "Панічіште", "Пловдив", "Помор'я", "Приморсько", "Равда", "Рів'єра",
        "русалка", "Русе", "Санданські", "Св. Костянтин та Олена", "Святий Влас", "Синеморець", "Созопіль",
        "Сонячний берег", "Сонячний день", "Софія", "Хісар", "Цареве"
    ],
    "Іспанія": [
        "Канарські острови", "о. Гран Канарія (Канари)", "Лас Пальмас", "Маспаломас", "Плайя дель Інглес",
        "Пуерто де Моган", "Пуерто Ріко", "Сан Агустін", "о. Лансароте (Канари)", "о. Пальма (Канари)",
        "о. Тенеріфе (Канари)", "Арона", "Гія де Ісора", "Ель Медано", "Кальяо Сальвахе", "Канделарія",
        "Коста Адехе", "Лос Крістіанос", "Плайя де лас Амерікас", "Плайя Параїсо", "Пуерто де ла Крус",
        "Пуерто де Сантьяго", "Сан Мігель де Абона", "Санта Крус де Тенеріфе", "о. Фуертевентура (Канари)",
        "Балеарські острови", "о. Ібіца", "о. Майорка", "Ель Ареналь", "Кала Майор", "Кала Міллор",
        "Кала Ратьяда", "Калас де Майорка", "Кан Пастілья", "Кан Пікафорт", "Магалуф", "Пагера", "Пальма де Майорка",
        "Пальманова", "Плайя Де Муро", "Плайя Де Пальма", "Порталс Ноус", "Порто Крісто", "Пуерто де Алькудія",
        "Са Кома", "Санта Понса", "о. Менорка", "Авіла", "Алава", "Алькала-де-Енарес", "Андалусія", "Аранхуес",
        "Бадахос", "Бакейра-Бере", "Барселона", "Більбао", "Бургос", "Валенсія", "Вальядолід", "Галісія",
        "Гвадалахара", "Гранада", "Ескоріал", "Жирона", "Калафель", "Кантабрія", "Комільяс", "Кордова",
        "Коста Асаар", "Коста Бланка", "Коста Брава", "Коста де Альмерія", "Коста Де Ла Лус", "Коста Дель Гарраф",
        "Коста Дель Маресме", "Коста Дель Соль", "Коста Дорада", "Коста Каліда", "Куенка", "Ла-Корунья", "Ла-Моліна",
        "Лас Пальмас", "Леон", "Луго", "Мадрид", "Малага", "Мурсія", "Наварра", "Ов'єдо", "Паламос", "Палафружель",
        "Реус", "Саламанка", "Сан Себастьян", "Сантандер", "Сантьяго-де-Компостела", "Сарагоса", "Севілья", "Сеговія",
        "Сьєрра-Невада", "тарифу", "Толедо", "Фігерас", "Хіхон"
    ],
    "Мальдіви": [
        "Адду Атол", "Арі (Аліфу) Атол", "Баа Атол", "Вааву Атол", "Гаафу Аліфу Атол", "Гаафу Даалу Атол",
        "Даалу Атол", "Лааму Атол", "Лхавіяні Атол", "Мале", "Мулаку (Міму) Атол", "Нуну Атол", "Південний Мале Атол",
        "Північний Мале Атол", "Раа Атол", "Тхаа Атол", "Фаафі Атол", "Хаа Аліфу Атол", "Шавіані Атол"
    ],
    "Танзанія": [
        "Занзібар Захід", "Бу Бу бу", "Занзібар – місто", "Мангапвані", "Занзібар Південний Схід", "Бведжу",
        "Джамбіані", "Донгве", "Макундучі", "Мічамві", "Паже", "Пінгве", "Чвака", "Занзібар Південь", "Кизимказі",
        "Занзібар Північний Схід", "Ківенгва", "Матемві", "Пвані Мчангані", "Занзібар Північ", "Кендва", "Нунгві",
        "Занзібар Схід", "Понгве", "Уроа", "Аруша", "Дар-ес-Салам", "Кіліманджаро", "Нгоронгоро", "озеро Маньяра",
        "Серенгеті", "Тарангире"
    ],
    "Домінікана": [
        "Регіон Пунта Кана", "Баваро", "Кап Кана", "Макао", "Пунта Кана", "Уверо-Альто", "Регіон Ла Романа",
        "Байаїбе", "Ла Романа", "Альтос Де Шавон", "Бараона", "Бока Чіка", "Кабарете", "Пуерто Плата", "Самана",
        "Санто-Домінго", "Хуан Доліо"
    ],
    "Таїланд": [
        "Бангкок", "Канчанабурі", "Као Лак", "Крабі", "о. Ланта", "о. Липі", "о. Пханган", "о. Пхі-Пхі", "о. Пхукет",
        "о. Самет", "о. Самуї", "о. Тао", "о. Чанг", "о. Яо Ной та Яї", "Паттайя", "Пхітсанулок", "Трат",
        "Ча-Ам & Хуа Хін", "Чанг Рай", "Чіанг Маї"
    ],
    "Україна": [
        "Арабатська стрілка", "Асканія-Нова", "Бахмач", "Бердичів", "Бердянськ", "Березне", "Біла Церква",
        "Білгород-Дністровський", "Більшовик", "Богуслав", "Бориспіль", "Борщів", "Бровари", "Буки", "Буча",
        "Бучач", "Васильків", "Вилкове", "Вишгород", "Вінниця", "Вознесенськ", "Ворзель", "Генічеськ", "Глухів",
        "Гола Пристань", "Грибівка", "Дніпро", "Донецьк", "Дрогобич", "Дубно", "Житомир", "Залізний Порт",
        "Запоріжжя", "Затока", "Золочів", "Івано-Франківськ", "Ізмаїл", "Ірпінь", "Ічня", "Кам'янець-Подільський",
        "Кам'янське", "Канів", "Кароліно-Бугаз", "Катранка", "Київ", "Кирилівка", "Кінбурнська коса", "Клевань",
        "Коблево", "Ковель", "Коломия", "Конча-Заспа", "Корець", "Коростень", "Коростишів", "Корсунь-Шевченківський",
        "Краматорськ", "Кременець", "Кременчук", "Кремінна", "Кривий Ріг", "Кропивницький", "Лазурне", "Лебедівка",
        "Лисичанськ", "Літки", "Луганськ", "Лугове", "Луцьк", "Львів", "Маріуполь", "Мелекіно", "Мелітополь", "Мена",
        "Миколаїв", "Миколаївка", "Миргород", "Могилів-Подільський", "Моршин", "Немирів", "Ніжин", "Нова Каховка",
        "Новгород-Сіверський", "Новомосковськ", "Обухів", "Одеса", "Олександрія", "Олесько", "Олешки", "Очаків",
        "Павлоград", "Первомайськ", "Переяслав-Хмельницький", "Пирятин", "Південне", "Полтава", "Почаїв", "Прилуки",
        "Приморськ", "Приморське", "Прип'ять", "Путила", "Пуща-Водиця", "Радехів", "Радомишль", "Ржищів", "Рівне",
        "Рогатин", "Саврань", "Санжейка", "Сарата", "Сатанов", "Святогірськ", "Седнєв", "Седово", "Сергіївка",
        "Сєвєродонецьк", "Скадовськ", "Сквира", "Соледар", "Старобільськ", "Стоянов", "Стрий", "Суми", "Сутківці",
        "Східниця", "Тарутине", "Татарбунари", "Теребовля", "Тернопіль", "Трипілля", "Тростянець (Сумська обл.)",
        "Тростянець (Чернігівська обл.)", "Трускавець", "Ужгород", "Умань", "Урзуф", "Фастів", "Фрузинівка", "Харків",
        "Херсон", "Хмельницький", "Хмільник", "Хорли", "Хорол", "Хортиця", "Хотин", "Черкаси", "Чернівці", "Чернігів",
        "Чертков (Чортків)", "Чигирин", "Чорнобиль", "Чорноморськ", "Шаргород", "Шацьк", "Шепетівка", "Шкло", "Шпола", "Ярмолинці"
    ],
    "Грузія": [
        "Адигени", "Аспиндза", "Ахалкалакі", "Ахалцихе", "Бакуріані", "Батумі", "Біля річки", "Боржомі", "Гудаурі",
        "Кварелі", "Кваріаті", "Кеда", "Кобулеті", "Кутаїсі", "Мцхета", "Поті", "Сванеті", "Сигнахи", "Тбілісі", "Телаві"
    ],
    "Албанія": [
        "Берат", "Бутринті", "Влера", "Дуррес", "Дхермі", "Круя", "Ксаміл", "Саранда", "Тирана", "Фіері", "Шкодер"
    ],
    "Чорногорія": [
        "Будванська Рів'єра", "Бечичі", "Будва", "Петровац", "Пржно", "Рафаїловичі", "Св. Стефан", "Бока-Которьска Затока",
        "Герцег Нові", "Котор", "Тіват", "Бар", "Жабляк", "Колашин", "Милочер", "о. Ада Бояна", "Пераст", "Підгориця",
        "Рисан", "Сутоморе", "Ульцинь", "Цетіньє"
    ],
    "Греція": [
        "о. Крит", "о. Крит – Агіос Ніколаос", "Агіос Ніколаос - місто", "Амудара", "Істро", "Мілатос", "Сіссі", "Сітія",
        "о. Крит – Елунда", "о. Крит – Ієрапетра", "Ієрапетра – місто", "Кутсунарі", "о. Крит – Іракліон", "Агія Пелагія",
        "Амудара", "Аналіпсі", "Аніссарас", "Гувес", "Гурнес", "Іракліон – місто", "Коккіні Хані", "Малія", "Сталіда",
        "Фоделе", "Херсонісос", "о. Крит – Ретимно", "Аделе", "Аделіанос Кампос", "Балі", "Епіскопі", "Міссірія",
        "Панормо", "Пігіанос Кампос", "Плакіас", "Платанес", "Ретімно – місто", "Скалета", "Ставроменос", "Сфакакі",
        "о. Крит – Ханья", "Агії Апостолі", "Агія Марина", "Алмірида", "Георгіуполіс", "Герані", "Кіссамос", "Колімварі",
        "Малеме", "Платаньяс", "Сталос", "Ханья – місто", "Халкідіки", "Халкідікі – Афон", "Ієрісос", "Скала", "Уранополіс",
        "Халкідікі – Кассандра", "Агіа Параскеві", "Афітос", "Каландра", "Каліфея", "Касандрія", "Кріопігі", "Неа Муданья",
        "Неа Потідея", "Неа Скіоні", "Пальюрі", "Пефкохорі", "Поліхроно", "Посіді", "Сані", "Сівірі", "Фурка", "Ханіоті",
        "Халдікікі – Неа Каллікратія", "Халдікікі – Сітонія", "Геракіні", "Елія", "Метаморфосі", "Неос Мармарас", "Нікіті",
        "Псакудія", "Тороні", "Александруполіс", "Арахового", "Арідея", "Аттика", "Афіни", "Волос", "Дельфи", "Еврос",
        "Епідавр", "Ігумениця", "Кавала", "Каймакцалан", "Калавріта", "Каламбака", "Камена Вурла", "Касторія", "Козані",
        "Ламія", "Лариса", "Левадія", "Литохоро", "Лутракі", "Месолонгіон", "Метеори", "Мікени", "Нафпліон", "о. Алонісос",
        "о. Андрос", "о. Астипалея", "о. Евбея", "о. Егіна", "о. Закінф", "о. Ідра", "о. Калімнос", "о. Карпатос",
        "о. Кастелорізо", "о. Кефалонія", "о. Китіра", "о. Корфу", "о. Кос", "о. Лерос", "о. Лесбос", "о. Лефкас", "о. Міконос",
        "о. Наксос", "о. Парос", "о. Патмос", "о. Родос", "о. Самос", "о. Санторіні", "о. Сімі", "о. Сірос", "о. Скіатос",
        "о. Скопелос", "о. Тасос", "о. Тилос", "о. Тінос", "о. Фолегандрос", "о. Халки", "о. Хіос", "Олімпія", "Парга",
        "Пелопоннес", "Пієрія", "Пісодері", "Порос", "Превеза", "Салоніки", "Сунион", "Яніна"
    ],
    "Великобританія": [
        "Абердін", "Бат", "Белфаст", "Бірмінгем", "Брістоль", "Віндзор", "Гебридские острови", "Глазго", "Джорджтаун",
        "Дувр", "Едінбург", "Ексетер", "Інвернес", "Йорк", "Кардіфф", "Кембридж", "Кентербер", "Ліверпуль", "Лідс",
        "Лланголлен", "Лландудно", "Лондон", "Лондондеррі", "Лутон", "Манчестер", "Ноттінгем", "Ньюкасл", "Оксфорд",
        "Плімут", "Портсмут", "Саутгемптон", "Стратфорд-на-Ейвоні", "Уелвін-Гарден-Сіті", "Харидж", "Шеффілд"
    ],
    "Італія": [
        "Венеціанська Рів'єра", "Лідо Ді Езоло", "Трієст", "Валле д’Аоста", "Аоста", "Курмайор", "Червінія", "Доломіті ді Брента",
        "Мадонна ді Кампільйо", "Пінцоло", "Доломітові Альпи", "Альта Бадіа", "Валь Гардена", "Валь Ді Фасса", "Валь-ді-Фьємме",
        "Кампітелло-ді-Фасса", "Канацея", "Кортіна д'Ампеццо", "Поца ді Фасса", "Альта Вальтелліна", "Борміо", "Лівіньо",
        "Абано Терме", "Алассіо", "Аллеге", "Алтопіано делла Паганеллі", "Амальфітанське узбережжя", "Анкона", "Анціо",
        "Арабба - Мармолада", "Ареццо", "Асколі-Пічено", "Ассізі", "Барі", "Барлетта", "Барчеллона-Поццо-ді-Готто",
        "Бассано-дель-Граппа", "Бергамо", "Болонья", "Больцано", "Бордігера", "Брешіа", "Бріндізі", "Валь ді Соле",
        "Валь ді Суса", "Венеція", "Верона", "Віареджіо", "Генуя", "Діано Маріна", "імперія", "Калабрія", "Кальярі", "Каррара",
        "Комо", "Кронплатц", "Кьоджа", "Лаціо", "Лечче", "Лигурийское узбережжі", "Ліворно", "Ліньяно", "Луини", "Лукка",
        "Мадесімо", "Масо Корто", "Мерано", "Мілан", "Монтальчине", "Монтегротто Терме", "Монтекатині", "Монтепунчіано",
        "Монца", "Неаполь", "о. Іскья", "о. Капрі", "о. Сардинія", "о. Сицилія", "оз. Гарда", "Оз. Комо", "Оз. Маджоре",
        "оз. поголоски", "Орвието", "Ортизеи", "П'єнца", "Падуя", "Палермо", "Парма", "Пассо Тонале", "Пезаро", "Перуджа",
        "Піза", "Піццо", "Помпеї", "Порретта Терме", "Портофіно", "Равенна", "Рапалло", "Рим", "Ріміні", "Савона", "Салерно",
        "Сан Ремо", "Сан-Джиміньяно", "Сан-Кашано-деї-Баньї", "Санта Катерина", "Селла Ронда", "Сестриере", "Сієна", "Сорренто",
        "Спеція", "Тагле-ді-По", "Таорміна", "Таранто", "Тарвізіо", "Тіволі", "Тірренське узбережжя", "Тоскана", "Тревізо",
        "Тренто", "Турін", "Удіне", "узбережжя Чіленто", "Феррара", "Флоренція", "Фоджа", "Фольгарія", "Форте-дей-Мармі",
        "Франкавілла-аль-Маре", "Фьюджі", "Чивитавеккья", "Чіветта"
    ],
    "Угорщина": [
        "Балатон", "Балатондерек", "Балатонфюред", "Будапешт", "Бюкфюрдо", "Вишеград", "Дебрецен", "Дьйор", "Дьюла", "Егер",
        "Егерсалок", "Естергом", "Залакарош", "Кестхей", "Ліллафюред", "Мезйокйовешд", "Мішкольц", "Мошонмадьяровар",
        "Надьканіжа", "Ніредьгаза", "Ноградгардонь", "Обудаї", "Печ", "Сегед", "Секешфехервар", "Сентендре", "Тапольца",
        "Тихань", "Токай", "Хайдусобосло", "Харкань", "Хевіз", "шарвар", "Шіофок", "Шопрон"
    ],
    "Німеччина": [
        "Аахен", "Альтенау", "Аугсбург", "Бад Заров", "Бад Кіссінген", "Бад Тельц", "Бад-Райхенхалль", "Бад-Хомбург",
        "Баден-Баден", "Бамберг", "Берлін", "Берхтесгаден", "Бонн", "Брауншвайг", "Бремен", "Веймар", "Вернигероде",
        "Вісбаден", "Вюрцбург", "Гамбург", "Ганновер", "Гарміш-Партенкірхен", "Гейдельберг", "Дортмунд", "Дрезден",
        "Дюсельдорф", "Ерфурт", "Еслое", "Ессен", "Кассель", "Кельн", "Кіль", "Констанц", "Лейпциг", "Леррах", "Ліндау",
        "Любек", "Магдебург", "Майсен", "Меерсбург", "Меммінген", "Місбах", "Мюнстер", "Мюнхен", "Нижня Саксонія", "Нюрнберг",
        "Оберстдорф", "Оберхаузен", "Оберштауфен", "Оффенбах", "Падерборн", "Пассау", "Потсдам", "Райт-ім-Вінкль", "Регенсбург",
        "Росток", "Ротенбург", "Рупольдинг", "Саарбрюкен", "Тангермюнде", "Трір", "Франкфурт-на-Майні", "Фрідріхсхафен", "Хамельн",
        "Хемніц", "Швангау", "Швенді", "Шверін", "Шлезвіг-Гольштейн", "Штральзунд", "Штутгарт"
    ],
    "Ісландія": [
        "Акюрейри", "високогір'ї", "Гепн", "Західна Ісландія", "західні Фіорди", "Кеблавік", "Південна Ісландія",
        "Північна Ісландія", "Рейк'явік", "Рейкхольт", "Східна Ісландія"
    ],
    "Індонезія": [
        "Бедугул (о. Балі)", "Вамена", "Денпасар (о. Балі)", "Джакарта (о. Ява)", "Джембрана (о. Балі)", "Джимбаран (о. Балі)",
        "Джок'якарта", "Іріан Джая", "Карангасем (о. Балі)", "Кута (о. Балі)", "Ловіна (о. Балі)", "Нуса Дуа (о. Балі)",
        "о. Бінтан", "о. Калімантан (Борнео)", "о. Ломбок", "о. Нуса-Пеніда", "о. Ринка", "о. Ява", "Санур (о. Балі)",
        "Семіньяк (о. Балі)", "Сулавесі", "Сурабая (о. Ява)", "Танджунг Беноа (о. Балі)", "Убуд (о. Балі)", "Чандидаса (о. Балі)"
    ],
    "Ізраїль": [
        "Ашдод", "Ашкелон", "Віфлеєм", "Герцлія", "Ейлат", "Єрусалим", "Кейсарія", "Мертве море", "Міцпе-Рамон", "Назарет",
        "Нетанія", "Рош-Пінна", "Тверія", "Тель Авів", "Хайфа", "Цфат", "Яффо"
    ],
    "Японія": [
        "Акіта", "Атамі", "Вакаяма", "Йокогама", "Камакура", "Канадзава", "Кіото", "Кобе", "Курасики", "Кусіро", "Мацумото",
        "Міядзіма", "Нагано", "Нагоя", "Нара", "Нікко", "о. Окінава", "о. Хоккайдо", "Окаяма", "Осака", "Саппоро", "Сиретоко",
        "Такамацу", "Такаяма (Гіфу)", "Токіо", "Токусіма", "Удзи", "Хакодате", "Хаконе", "Хімедзі", "Хіросіма"
    ],
    "Йорданія": ["Акаба", "Амман", "Ваді-Рам", "Маїн", "Мертве море", "Петра"],
    "Катар": ["Доха"],
    "Польща": [
        "Беловежа", "Бельсько-Бяла", "Бидгощ", "Болеславец", "Бржеський", "Бялка Татранська", "Варшава", "Величка", "Вісла",
        "Вроцлав", "Гданськ", "Гдиня", "Гіжицько", "Дзвіжіно", "Жагань", "Жешув", "Закопане", "Замосць", "Зелена Гура",
        "Карпач", "Катовіце", "Колобжег", "Косцежіна", "Краків", "Криниця", "Кудова-Здруй", "Лагув", "Леба", "Легніца",
        "Ленчиця", "Лодзь", "Люблін", "Мальборк", "Миколайки", "Неборов", "Новий Вісьнич", "Ойцов", "Ольштин", "Ополе",
        "Освенцим", "Погожеліца", "Познань", "Поляниця-Здруй", "Поляньчик", "Пшемисль", "Свіноуйсцю", "Семяновіце-Шльонські",
        "Сопот", "Тарнув", "Торунь", "Устка", "Устрики-Долішні", "Устроне Морське", "Ченстохова", "Шклярська Поремба", "Щецін",
        "Щирк", "Ястшембя Гура"
    ],
    "Румунія": [
        "Азуга", "Алба-Юлія", "Арад", "Бакеу", "Бая-Маре", "Бирлад", "Браїла", "Брашов", "Бухарест", "Венус (Венера)", "Галац",
        "Ефоріє Норд і Ефоріє Суд", "кап Аврора", "Кимполунг", "Клуж-Напока", "Ковасна", "Констанца", "Костінешть", "Крайова",
        "Мама я", "Нептун-Олімп", "Орадя", "Передял", "Пояна Брашов", "Пятра Нямц", "Сату-Маре", "Синая", "Сібіу", "Сігішоара",
        "Сленік-Молдова", "Совата", "Сучава", "Тиргу-Муреш", "Тімішоара", "Фокшани", "Юпітер", "Ясси"
    ],
    "Кенія": ["Абердер", "Амбоселі", "Малінді", "Маралал", "Масаї Мара", "Момбаса", "Найваша", "Найробі", "Накуру", "Самбуру"],
    "Нідерланди": [
        "Амстердам", "Волендам", "Гаага", "Делфт", "Ейндховен", "Заансе Сханс", "Зандам", "Ліссе", "Маастрихт", "Нордвейк",
        "о. Бонайре", "Роттердам", "Сассенхейм", "Утрехт", "Харлем"
    ],
    "Філіппіни": ["Бохоль", "Давао", "о. Боракай", "о. Лусон", "о. Лусон - Маніла", "о. Мактан", "о. Палаван", "о. Себу", "Пасай"],
    "Хорватія": [
        "Середня Далмація", "Башка Вода", "Брело", "Макарська", "о. Брач", "о. Хвар", "о. Чіово", "Оміш", "Спліт", "Трогір", "Хмари",
        "Північна Далмація", "Біоград", "Водиці", "Задар", "о. Паг", "Шибеник", "Кварнер", "Нові Винодольські", "о. Крк", "о. Лошинь",
        "о. Раб", "Опатия", "Рієка", "Сільце", "Цриквениця", "Центральна Хорватія", "Загреб", "Південна Далмація", "Дрвеник",
        "Дубровник", "Млини", "о. Корчула", "Оребич", "Підгора", "Трпань", "Цавтат", "Істрія", "Врсар", "Ловран", "Медулін",
        "Новиград", "о. Бріоні", "Пореч", "Пула", "Рабаць", "Ровинь", "Умаг", "вела Лука", "Жівогоще", "Істрія", "о. Віс", "о. Лопуд",
        "о. Млет", "о. Црес", "о. Шолта", "Плитвицкие озера", "Прімоштен", "Рогозніца"
    ],
    "Латвія": ["Бауска", "Валмієра", "Вентспілс", "Даугавпілс", "Єкабпілс", "Єлгава", "Кулдига", "Лієпая", "Мадона", "Резекне", "Рига", "Сігулда", "Цесіс", "Юрмала"],
    "Чехія": [
        "Бржецлав", "Брно", "Гаррахов", "Есеник", "Желєзна Руда", "Злін", "Карлові Вари", "Костелець", "Кромержиж", "Кутна Гора",
        "Лазні Білоград", "Липно", "Лугачовице", "Маріанське-Лазне", "Махов", "Оломоуц", "Острава", "Пардубіце", "Пец під Сніжків",
        "Пльзень", "Подебради", "Прага", "Рокитніце-над-Йізероу", "Телч", "Теплиці", "Тршебонь", "Франтишкові Лазні", "Ческі-Штернберк",
        "Чеське Будейовіце", "чеський Крумлов", "Шпіндлеров Млин", "Янске Лазні", "Яхімов"
    ],
    "Кіпр": ["Південний Кіпр", "Айя Напа", "Ларнака", "Лімассол", "Пафос", "Протарас", "Троодос", "Кирінія", "Нікосія", "Фамагуста"],
    "Фінляндія": [
        "Аландські острови", "Вааса", "Вуокатті", "Гельсінкі", "Ікаалінен", "Іматра", "Ісосюёте", "Калайокі", "Каяні", "Кемі", "Кіттіла",
        "Котка", "Коувола", "Куопіо", "Куусамо", "Лапландія", "Лаппеенранта", "Лахті", "Леві", "Леппявірта", "Ловіза", "Луосто",
        "Міккелі", "Муоніо", "Оулу", "Пальякка", "Порвоо", "Пункахарью", "Пюха", "Раума", "Рованіемі", "Рука", "Сааріселькя",
        "Савонлінна", "Сюете", "Таммісаарі", "Тампере", "Тахко", "Торнио-Хапаранда", "Турку", "Хамина", "Ханко", "Химос", "Ювяскюля", "Юлляс"
    ],
    "Португалія": [
        "Лісабонська Рів'єра", "Кашкайш", "Алгарве", "Алкобаса", "Баталья", "Брага", "Гімарайнш", "Евора", "Ерісейра", "Ешторіл",
        "Карташу", "Коїмбра", "Лісабон", "Мадалена (о. Піку)", "Мафра", "о. Мадейра", "о. Сан-Жоржі", "о. Терсейра", "Обідуш",
        "Пезу-да-Регуа", "Понта-Делгада", "порту", "Серра-да-Ештрела", "Синтра", "Томар", "Фатіма", "Хорта (о. Фаял)"
    ],
    "Швейцарія": [
        "Ароза", "Аскона", "Бад Рагац", "Базель", "Беллінцона", "Берн", "Бруно", "Веве", "Веггіс", "Венген", "Вербье", "Віллар",
        "Віцнау", "Гріндельвальд", "Грюйєр", "Гштаадт", "Давос", "Женева", "Замнаун", "Івердон-ле-Бан", "Інтерлакен", "Кран-Монтана",
        "Лахен", "ле Дьяблере", "Лекербад", "Лозанна", "Локарно", "Лугано", "Люцерн", "Монтре", "Нендаз", "Саас-Фе", "Санкт-Моріц",
        "Торгон", "Флімс-Лаакс-Фалера", "Церматт", "Цюріх", "Шаффхаузен", "Швіц", "Штайн-на-Рейні"
    ],
    "Литва": ["Алітус", "Вільнюс", "Друскінінкай", "Каунас", "Клайпеда", "Маріямполе", "Неринга", "Паланга", "Таураге", "Тракай", "Шилуте", "Шяуляй"],
    "Мальта": [
        "Аура", "Бірзеббуджа", "Буджибба", "Валлетта", "Куренді", "Марсаскала", "Мджарр", "Мдіна", "Мелієха", "о. Гоцо", "о. Коміно",
        "Сан Джуліанс", "Сан Паула Бей", "Сліма", "Таршин", "Чіркева"
    ],
    "Франція": [
        "Авіньйон", "Авориаз", "Альп д'Юез", "Амбуаз", "Ансі", "Антіб", "аркашон", "Арль", "Арроманш", "Байо", "Бандоль", "Біарріц",
        "Блакитний берег", "Блуа", "Бордо", "Бретань", "Брід Ле Бен", "Бургундія", "Валь д'Ізер", "Валь Сені", "Валь Торанс", "Віші",
        "Вьенн", "гордий", "Грас", "Гренобль", "Діснейленд", "Довіль", "Ев'ян-ле-Бен", "Екс-ан-Прованс", "Жуан ле Пен", "Кабрієр-д'Авіньйон",
        "Кавайон", "Канни", "кап Ферра", "Каркассон", "Карпантра", "Кольмар", "Куршевель", "Л'Іль-сюр-ла-Сорг", "Ла Біль", "Ла Плань",
        "Ла-Розьер", "Лангедок - Руссільйон", "Ле дез Альп", "ле Менюїр", "ле Сібель", "Ле-Бо-де-Прованс", "Лез Арк", "Лілль", "Лімож",
        "Ліон", "Лурд", "ля Танья", "Мандела", "Марсель", "Межев", "Ментон", "Мерібель", "Метц", "ним", "Ніцца", "Нормандія", "о. Гваделупа",
        "о. Корсика", "о. Мартинюк", "о. Реюньйон", "о. Сан Бартелемі", "о. Сен-Мартен", "Онфлер", "Орлеан", "Париж", "Перн-ле-Фонтен",
        "Прованс", "Пуент-а-Пітр", "Реймс", "Руан", "Санліс", "Сен-Максімен-ла-Сент-Бом", "Сен-Мало", "Сен-Ремі-де-Прованс", "Сен-Тропе",
        "Сент-Марі-де-ла-Мер", "Серра Шевальє", "Страсбург", "Тінь", "Трувіль", "Тулон", "Тулуза", "тур", "Турнон", "Флен", "Фор-де-Франс",
        "фужер", "Шамоні"
    ],
    "Бразилія": [
        "Амазонія", "Ангра душ Рейш", "Балнеаріу-Камборіу", "Боніто", "Бразиліа", "Бузіус", "Ігуасу", "Ілля-Гранді", "Ітажаї", "Ітакаре",
        "Коста до Сауіпе", "Ленсойш", "Манаус", "Натал", "о. Ільябела", "Пантанал", "Порт-Сегуру", "Порту-Белу", "Ресіфі", "Ріо-де-Жанейро",
        "Сальвадор", "Сан-Паулу", "Флоріанополіс", "Форталеза"
    ],
    "Індія": [
        "Агра", "Алчі", "Амрітсар", "Багдогра", "Бангалор", "Белларі", "Біканер", "Бомбей (Мумбай)", "Бхубанешвар", "Варанасі", "Вріндавана",
        "Гангток", "Гуджарат", "Гульмарг", "Дарджилінг", "Делі", "Джайпур", "Джайсалмер", "Джодхпур", "Дхармсала", "Калімпонг", "Калькутта",
        "Керала", "кота", "Куллу", "Кхаджурахо", "Ламаюру", "Лех", "Маналі", "Манді", "Мурудешвара", "південний Гоа", "північний Гоа", "Пуна",
        "Пурі", "Путтапарті", "Рішікеш", "Тіруванантапурам", "Удайпур", "Улейтокпо", "Хайдарабад", "Харідвар", "Чандігарх", "Чинний", "Шимла", "Шрінагар"
    ],
    "Марокко": ["Агадір", "Бені-Меллаль", "Дахла", "Ерфуд", "Ес-Сувейра", "Загора", "Іфран", "Касабланка", "Марракеш", "Надор", "Рабат", "Сиди-Іфні", "Танжер", "Тарудант", "Фес"],
    "Маврикій": ["о. Маврикій", "порт Луї"],
    "Словаччина": [
        "Банська Бистриця", "Банська Штявніца", "Бардеев", "Бешенева", "Бойніце", "Братислава", "Валчанская Долина", "Велка Ломніца", "Вишні Ружбахи",
        "Герлахом", "гірський Семаківці", "Дольний Кубін", "Доновали", "Дудинце", "Ждяр", "Жиліна", "Зволен", "зємплінскі Ширава", "Калужа", "Кошице",
        "Кремніца", "Кромпахи", "Левоча", "Ліптовський Мікулаш", "Мартинська Голі", "Міхаловце", "Нітра", "новий Смоковець", "Ощадніца", "Подбанске",
        "Попрад", "Пьештяни", "Раєцке Тепліце", "Ружомберок", "Скаліца", "Сліач", "Смрдаки", "сонячні озера", "Стара Любовня", "Старий Смоковець",
        "Талі", "Татранська Котлина", "Татранська Ломниця", "Татранська Яворина", "Терхова", "Тренчіанске Тепліце", "Трнава", "Турчіанске Тепліце",
        "Штрбське Плесо", "Ясна"
    ],
    "Сейшельські острови": [
        "о. Альфонс", "о. Берд", "о. Денис", "о. Дерош", "о. Кузин", "о. курйоз", "о. Ла Діг", "о. Мае", "о. Норт", "о. Праслін", "о. Силует", "о. фрегат"
    ],
    "Норвегія": [
        "Берген", "Буді", "Восс", "Гаупне", "Гейло", "Гудванген", "Ейдфьорд", "Конгсберг", "Крістіансунн", "Лейкангер", "Ліллехаммер", "Лофотенськие острови",
        "Мефьорд", "Олесунн", "Оппдал", "Оппстрін", "Осло", "Савален", "Ставангер", "Сталхейм", "Тромсе", "Тронхейм", "Трюсиль", "Фагернес", "Фарсунн",
        "Фіннмарк", "Флом", "Хаммерфест (Нордкап)", "Хафьель", "Хемседал", "Хундерфоссен", "Шпіцберген"
    ],
    "Північна Македонія": ["Берово", "Бітола", "Дебар", "Крушево", "Маврово", "Охрід", "Попова Шапка", "Скоп'є"],
    "Мексика": [
        "Акапулько", "Атотонілько де Тула", "Гвадалахара", "Гуанахуато", "Ікстапа", "Кампече", "Канкун", "Косумель", "Меріда", "Мехіко", "Морелія", "Оахака",
        "Паленке", "Патцкуаро", "Плая дель Кармен", "Пуебла", "Пуерто Валларта", "Рив'єра Майя", "Сан Крістобаль", "Сан Хосе Де Кабо", "Сантьяго-де-Керетаро",
        "Таско", "Теуантепек", "Уатулько"
    ],
    "Сербія": [
        "Аранджеловац", "Белград", "Врнячка-Баня", "Златібор", "Копаоник", "Крушевац", "Куштіца", "ЛУКІВСЬКА Баня", "Мечавник", "мокра Гора", "ніш", "Нові Сад",
        "Опленац", "Палич", "Пожаревац", "Пролом-Баня", "Сремски Карловці", "Суботіца", "Ужице", "Фрушка-Гора", "Чачак", "Ягодина"
    ],
    "Малайзія": [
        "Бінтулу", "Бьюфорт", "Джохор", "Камерон Хайлендс", "кота Кінабалу", "Кота-Бару", "Кота-Кінабатанган", "Куала Лумпур", "Куантан", "Куах", "Кудат", "Кучінг",
        "Лахад-Дату", "Малакка", "Мірі", "муках", "о. Борнео", "о. Ланг Тенга", "о. Лангкаві", "о. Ланкаян", "о. Пангкор", "о. Пенанг", "о. Реданг", "о. Тертл",
        "о. Тіоман", "порт Діксон", "Сандакан", "Семпорна", "Тавау", "Чератінг"
    ],
    "Туніс": ["Гаммарт", "Дуз", "Ель-Джем", "Енфіда", "Картаж", "Махдія", "Монастир", "Набіль", "о. Джерба", "Порт Ель Кантауї", "Сусс", "Сфакс", "Табарка", "Туніс", "Хаммамет"],
    "Словенія": [
        "Блед", "Бовец", "Бохинь", "Вогель", "Добрна", "Доленьске Топліце", "Здравіліще Лашко", "Ізола", "Кобла", "Копер", "Краньська Гора", "Лендава", "Любляна",
        "Маріборське Похорье", "Моравске Топліце", "Ново-Місце", "Піран", "Порторож", "Птуй", "Раденці", "Рогашка Слатина", "Рогла", "Струньян", "Терме Зрече",
        "Терме Чатеж", "Терми Олімія", "Шмарьєшке Топліце"
    ],
    "Швеція": ["Вестерос", "Гетеборг", "Карлстад", "о. Готланд", "Оверкалікс", "Оре", "Сигтуна", "Стокгольм", "Упсала", "Юккас'ярві"],
    "В'єтнам": [
        "Баолок", "Вунгтау", "Далат", "Дананг", "Кантхо", "Нячанг", "о. кон Дао", "о. Фукуок", "Сапа", "Фант'єт", "Халонг", "Ханой", "Хой Ан", "Хошимін", "Хюе", "Чаудок"
    ],
    "Казахстан": ["Актау", "Актобе", "Алмати", "Астана", "Байконур", "Усть-Каменогорськ", "Шимкент", "Щучинськ"],
    "Аруба": ["Ораньестад"],
    "Австралія": [
        "Аделаїда", "Айерс-Рок", "Аліс-Спрінгс", "Брісбен", "Великий Бар'єрний риф", "Дарвін", "Золотий берег", "Канберра", "Кернс", "Лонсестон", "Мельбурн",
        "о. кенгуру", "Острови Квінсленда", "Перт", "Сідней", "Улуру", "Фрімантл", "Хобарт"
    ],
    "Аргентина": [
        "Барілоче", "Буенос Айрес", "Ель Калафате", "Ігуасу", "Мар-дель-Плата", "Мендоса", "Пурмамарка", "Сальта", "Сан Хуан", "Сан-Сальвадор-де-Жужуй", "Ушуайя"
    ],
    "Барбадос": ["Бриджтаун"],
    "Багами": ["Багами", "Нассау", "о. Кококо", "Фрипорт"],
    "Боснія і Герцеговина": ["Меджугор'є", "Сараєво", "Требінье"],
    "Ботсвана": ["Габороне", "Чобе"],
    "Бахрейн": ["Манама"],
    "Венесуела": [
        "Амасонас", "Анхель", "Арагуа", "Барінас", "Валенсія", "Варгас", "Гурі", "Дельта Оріноко", "Дельта-Амакуро", "Канайма", "Каракас", "колонія Товар",
        "Кумана", "Лос Кальдеронес", "Лос Рокес", "Лос-Льянос", "Маракайбо", "Меріда", "Моррокой", "о. коче", "о. Маргарита", "Парія", "Пуерто-ла-Крус",
        "Пуерто-Ордас", "Сьюдад-Болівар", "Сьюдад-Гуаяна"
    ],
    "Гондурас": ["Копан", "Ла-Сейба", "о. Гуанаха", "о. Роатан", "о. Утіла", "Сан Педро Сула", "Тегусігальпа"],
    "Зімбабве": ["Хараре"],
    "Канада": ["Ванкувер", "Галіфакс", "Едмонтон", "Калгарі", "Квебек", "Монреаль", "Оттава", "Торонто"],
    "Киргизія": ["Бішкек", "Ош", "Чолпон-Ата"],
    "Камбоджа": ["Баттамбанг", "до Конг", "Кеп", "Ко-Дек-Куль", "Пномпень", "Сіануквіль", "Сієм Ріеп"],
    "Колумбія": [
        "Баїя Солано", "Баранкілья", "Богота", "Вілья-де-Лейва", "Картахена", "Медельїн", "о.Росаріо", "Перейра", "Ракіра", "Сан-Андрес", "Санта-Марта"
    ],
    "Ліван": ["Барук", "Бейрут", "Біблос", "Бішара", "Джун", "Долина Бекаа", "Захле", "кедри", "тир", "Тріполі", "Фарайя", "Хамман", "ЧОФ"],
    "Мадагаскар": [
        "Андасібе", "Анкарано", "Анкіфіев", "Антананаріву", "Анцирабе", "Анциранана", "Махаджанга", "Мурундава", "Національний парк Ісало", "Нусі-Бе",
        "Туамасіна", "Туліара", "Фіанаранцуа", "Цінжі-дю-Бемараха"
    ],
    "Монако": ["Монако", "Монте Карло"],
    "Монголія": ["Улан-Батор"],
    "Намібія": ["Віндхук", "Людериц", "Свакопмунд", "Уолфиш-Бей"],
    "Непал": ["Катманду", "Кумджунг", "Лумбіні", "Нагаркот", "Покхара", "Читван"],
    "Нікарагуа": ["Манагуа"],
    "Нова Зеландія": [
        "бухта Достатку", "Ванака", "Веллінгтон", "Гамільтон", "Данідін", "затока островів", "Квінстаун", "Крайстчерч", "льодовик Фокса", "Льодовик Франца-Йосифа",
        "Нейпір", "Нортленді", "Окленд", "Піктон", "Роторуа", "Стюарт", "Таупо", "Те-Анау"
    ],
    "Оман": ["Вахіба", "Маскат", "Мусандам", "Нізва", "Салала", "Сохар", "Сур"],
    "Панама": ["Бокас дель Торо", "Колон", "Панама"],
    "Перу": [
        "Арекіпа", "Іка", "Ікітос", "Кабанаконде", "Кахамарка", "Колка", "Куско", "Ліма", "Мачу Пікчу", "Наска", "П'юра", "Пуерто Мальдонадо", "Пуно", "Трухільо",
        "Тумбес", "Укаялі", "Чиклайо", "Юкай"
    ],
    "Саудівська Аравія": ["Ер-Ріяд", "Мекка"],
    "Сенегал": ["Дакар"],
    "Сінгапур": ["Сентоса", "Сінгапур"],
    "США": [
        "Анахайм", "Анкоридж", "Аннаполіс", "Арізона", "Аспен", "Аспен Маунтін", "Аспен Сноумасс", "Аспен Хайлендс", "Атланта", "Атлантик-Сіті", "Балтимор",
        "Баттермілк", "Бівер-Крік", "Бостон", "Брекенрідж", "Вашингтон", "Вейл", "Гавайські острови", "Гаррісберг", "Гранд Каньйон", "Детройт", "Діа Веллі",
        "канаб", "Каньонс", "Катскілл", "Кистоун", "Кі-Уест", "Лас-Вегас", "Лексінгтон (Віргінія)", "Лос Анджелес", "Майамі", "Малібу", "мис Канаверал", "Моаб",
        "Напа", "Нашвілл", "Ніагара-Фолс", "Новий Орлеан", "Норфолк", "Нью Йорк", "Нью-Хейвен", "Ньюпорт", "Олбані", "Орландо", "парк Сіті", "Поконо", "Портленд",
        "Прінстон", "Провіденс", "Рочестер", "Сакраменто", "Сан Франциско", "Сан-Дієго", "Сан-Луїс-Обіспо", "Сан-Симеон", "Сан-Хосе", "Санта-Барбара", "Санта-Круз",
        "Сіетл", "Солванг", "Солт Лейк Сіті", "Стенфорд", "Тампа", "Філадельфія", "Форт-Лодердейл", "Цинциннаті", "Чикаго", "Шарлотта-Амалія"
    ],
    "Уганда": ["Кампала"],
    "Еквадор": [
        "Баньос", "Галапагоські острови", "Гуаякіль", "Кіто", "Куенка", "о. Санта Крус", "Отавало", "Пуерто Лопес", "Пуерто-Місахуалі", "Ріобамба", "Салінас"
    ],
    "ПАР": [
        "Джордж", "Дурбан", "Іст-Лондон", "Йоганнесбург", "Кейптаун", "Кімберлі", "книсна", "Кнісна", "Монтегю", "Моссел Бей", "Оудсхурн", "парк Крюгер",
        "Піланесберг", "Плеттенберг Бей", "Порт-Елізабет", "Преторія", "Сан Сіті", "Содвана Бей", "Хоедспруіт"
    ],
    "Ямайка": ["Кінгстон", "Монтего-Бей", "Негрил", "Очо Ріос", "Порт-Антоніо", "ранових Бей", "Спаніш-Таун", "трилону"],
    "Андорра": [
        "Вальнорд", "Ла Массана", "Пал-Арінсаль", "Грандваліра", "Енкамп", "Канільйо", "Па де ля Каса", "Сольдеу - Ель Тартер", "Андорра Ла Велья",
        "Ескальдес - Енгордані", "Ордіно-Аркаліс"
    ],
    "Вірменія": ["Арташаті", "Вагаршапат", "Гарні", "Горіс", "Джермук", "Діліжан", "Єреван", "Єхегнадзор", "Севан", "Цахкадзор"],
    "Австрія": [
        "Тіроль", "Галтюр", "Ец", "Зеєфельд", "Зелль", "Зельден", "Іглз", "Інсбрук", "Ішгль", "Кіцбюель", "Куфштайн", "Лієнц", "Майрхофен", "Піцталь",
        "Санкт-Антон", "Серфаус", "Фюген", "Ціль ам Циллер", "Зальцбургерленд", "Бад Гаштайн", "Бад Хофгаштайн", "Заальбах", "Зальцбург", "Капрун",
        "Мета ам Зеї", "Флахау", "Альтенмаркт - Цаухензее", "Аннаберг", "Бад Кляйнкірххайм", "Баден", "Брегенц", "Брук-на-Мурі", "Ваграйн", "Вармбад Філлах",
        "Відень", "Гмунден", "Гоїнг", "Грац", "Дорнбирн", "Карінтія", "Кирхдорф", "Клагенфурт", "Кріммл", "Лех", "Лінц", "Мурау", "Наудерс", "Нойзідль-ам-Зе",
        "Нойштіфт", "Обергургль", "Пертісау", "Пертчах", "Пертшах", "Ригерсбург", "Санкт-Вольфганг", "Санкт-Гільген", "Санкт-Йоганн-ім-Понгау",
        "Санкт-Канціан", "Фельден", "Хинтерглемм", "Хіппах", "Хохгургль", "Циллерталь", "Цюрс", "Шладмінг", "Шпитталь"
    ],
    "Азербайджан": ["Баку", "Габала", "губа", "гусар", "Гянджа", "Ленкорань", "Нафталан", "Шеки"],
    "Бельгія": ["Антверпен", "Брюгге", "Брюссель", "Гент", "Льєж", "Шім'ї"],
    "Україна (Карпати)": [
        "Берегове", "Буковель (Поляниця)", "Верховина", "Вижниця", "Виноградів", "Воловець", "Ворохта", "Долина", "Драгобрат", "Жденієво", "Закарпатті",
        "Іза", "Іршава", "Калуш", "Кобилецька Поляна", "Косів", "Кострина", "Мигово", "Микуличин", "Міжгір'я", "Мукачево", "Орів", "Орявчик-Звенів",
        "Перечин", "Пилипець", "Плав'є", "Подобовець", "Поляна", "Рахів", "Розлуч", "Свалява", "Синевир", "Синяк", "Сколе", "Славсько", "Солотвино",
        "Солочин", "Татарів", "Тисовець", "Тячів", "Усть-Чорна", "Хуст", "Чинадієво", "Чоп", "Шаян", "Шешори", "Яблуниця", "Яноші", "Яремче", "Ясіня"
    ],
    "Китай": [
        "Аньхой", "Бейдайхе", "Гуанчжоу", "Гуйлінь", "Далянь", "Дунгуань", "Куньмін", "Ліцзян", "Лоян", "Макао", "о. Хайнань", "Пекін", "Сіань", "Сучжоу",
        "Ухань", "Ханчжоу", "Циньхуандао", "Ченде", "Чжанцзяцзе", "Чунцин", "Шанхай", "Шеньчжень", "Яньтай"
    ],
    "Куба": [
        "Баракоа", "Варадеро", "Гавана", "Гуардалавака", "Долина Віньялес", "Камагуей", "Матансас", "о. Кайо Гільєрмо", "о. Кайо-Коко", "о. Кайо-Ларго",
        "о. Санта Марія", "Ольгин", "Пінар-дель-Ріо", "Санкті Спірітус", "Санта Клара", "Сантьяго-де-Куба", "Сороа", "Сьєнфуегос", "Тринідад"
    ],
    "Данія": ["Біллунд", "Копенгаген", "о. Гренландія", "Роскилле", "Хельсингер", "Хіллеред"],
    "Естонія": [
        "Вільянді", "Кейла", "Лауласмаа", "Нарва", "Нарва-Йиесуу", "Пярну", "Сааремаа", "Таллінн", "Тарту", "Тойла", "Хаапсалу"
    ]
}

# Create or update City entries
for country, cities in cities_data.items():
    for city_name in cities:
        City.objects.get_or_create(name=city_name, country=country)

print("All city data has been successfully loaded!")